OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18lf26k80.c
__at(0x0F1C) __sfr TXB1D6;
__at(0x0F1C) volatile __TXB1D6bits_t TXB1D6bits;

__at(0x0F1D) __sfr TXB1D7;
__at(0x0F1D) volatile __TXB1D7bits_t TXB1D7bits;

__at(0x0F1E) __sfr CANSTAT_RO2;
__at(0x0F1E) volatile __CANSTAT_RO2bits_t CANSTAT_RO2bits;

__at(0x0F1F) __sfr CANCON_RO2;
__at(0x0F1F) volatile __CANCON_RO2bits_t CANCON_RO2bits;

__at(0x0F20) __sfr TXB0CON;
__at(0x0F20) volatile __TXB0CONbits_t TXB0CONbits;

__at(0x0F21) __sfr TXB0SIDH;
__at(0x0F21) volatile __TXB0SIDHbits_t TXB0SIDHbits;

__at(0x0F22) __sfr TXB0SIDL;
__at(0x0F22) volatile __TXB0SIDLbits_t TXB0SIDLbits;

__at(0x0F23) __sfr TXB0EIDH;
__at(0x0F23) volatile __TXB0EIDHbits_t TXB0EIDHbits;

__at(0x0F24) __sfr TXB0EIDL;
__at(0x0F24) volatile __TXB0EIDLbits_t TXB0EIDLbits;

__at(0x0F25) __sfr TXB0DLC;
__at(0x0F25) volatile __TXB0DLCbits_t TXB0DLCbits;

__at(0x0F26) __sfr TXB0D0;
__at(0x0F26) volatile __TXB0D0bits_t TXB0D0bits;

__at(0x0F27) __sfr TXB0D1;
__at(0x0F27) volatile __TXB0D1bits_t TXB0D1bits;

__at(0x0F28) __sfr TXB0D2;
__at(0x0F28) volatile __TXB0D2bits_t TXB0D2bits;

__at(0x0F29) __sfr TXB0D3;
__at(0x0F29) volatile __TXB0D3bits_t TXB0D3bits;

__at(0x0F2A) __sfr TXB0D4;
__at(0x0F2A) volatile __TXB0D4bits_t TXB0D4bits;

__at(0x0F2B) __sfr TXB0D5;
__at(0x0F2B) volatile __TXB0D5bits_t TXB0D5bits;

__at(0x0F2C) __sfr TXB0D6;
__at(0x0F2C) volatile __TXB0D6bits_t TXB0D6bits;

__at(0x0F2D) __sfr TXB0D7;
__at(0x0F2D) volatile __TXB0D7bits_t TXB0D7bits;

__at(0x0F2E) __sfr CANSTAT_RO1;
__at(0x0F2E) volatile __CANSTAT_RO1bits_t CANSTAT_RO1bits;

__at(0x0F2F) __sfr CANCON_RO1;
__at(0x0F2F) volatile __CANCON_RO1bits_t CANCON_RO1bits;

__at(0x0F30) __sfr RXB1CON;
__at(0x0F30) volatile __RXB1CONbits_t RXB1CONbits;

__at(0x0F31) __sfr RXB1SIDH;
__at(0x0F31) volatile __RXB1SIDHbits_t RXB1SIDHbits;

__at(0x0F32) __sfr RXB1SIDL;
__at(0x0F32) volatile __RXB1SIDLbits_t RXB1SIDLbits;

__at(0x0F33) __sfr RXB1EIDH;
__at(0x0F33) volatile __RXB1EIDHbits_t RXB1EIDHbits;

__at(0x0F34) __sfr RXB1EIDL;
__at(0x0F34) volatile __RXB1EIDLbits_t RXB1EIDLbits;

__at(0x0F35) __sfr RXB1DLC;
__at(0x0F35) volatile __RXB1DLCbits_t RXB1DLCbits;

__at(0x0F36) __sfr RXB1D0;
__at(0x0F36) volatile __RXB1D0bits_t RXB1D0bits;

__at(0x0F37) __sfr RXB1D1;
__at(0x0F37) volatile __RXB1D1bits_t RXB1D1bits;

__at(0x0F38) __sfr RXB1D2;
__at(0x0F38) volatile __RXB1D2bits_t RXB1D2bits;

__at(0x0F39) __sfr RXB1D3;
__at(0x0F39) volatile __RXB1D3bits_t RXB1D3bits;

__at(0x0F3A) __sfr RXB1D4;
__at(0x0F3A) volatile __RXB1D4bits_t RXB1D4bits;

__at(0x0F3B) __sfr RXB1D5;
__at(0x0F3B) volatile __RXB1D5bits_t RXB1D5bits;

__at(0x0F3C) __sfr RXB1D6;
__at(0x0F3C) volatile __RXB1D6bits_t RXB1D6bits;

__at(0x0F3D) __sfr RXB1D7;
__at(0x0F3D) volatile __RXB1D7bits_t RXB1D7bits;

__at(0x0F3E) __sfr CANSTAT_RO0;
__at(0x0F3E) volatile __CANSTAT_RO0bits_t CANSTAT_RO0bits;

__at(0x0F3F) __sfr CANCON_RO0;
__at(0x0F3F) volatile __CANCON_RO0bits_t CANCON_RO0bits;

__at(0x0F47) __sfr CCP5CON;
__at(0x0F47) volatile __CCP5CONbits_t CCP5CONbits;

__at(0x0F48) __sfr CCPR5;

__at(0x0F48) __sfr CCPR5L;

__at(0x0F49) __sfr CCPR5H;

__at(0x0F4A) __sfr CCP4CON;
__at(0x0F4A) volatile __CCP4CONbits_t CCP4CONbits;

__at(0x0F4B) __sfr CCPR4;

__at(0x0F4B) __sfr CCPR4L;

__at(0x0F4C) __sfr CCPR4H;

__at(0x0F4D) __sfr CCP3CON;
__at(0x0F4D) volatile __CCP3CONbits_t CCP3CONbits;

__at(0x0F4E) __sfr CCPR3;

__at(0x0F4E) __sfr CCPR3L;

__at(0x0F4F) __sfr CCPR3H;

__at(0x0F50) __sfr CCP2CON;
__at(0x0F50) volatile __CCP2CONbits_t CCP2CONbits;

__at(0x0F50) __sfr ECCP2CON;
__at(0x0F50) volatile __ECCP2CONbits_t ECCP2CONbits;

__at(0x0F51) __sfr CCPR2;

__at(0x0F51) __sfr CCPR2L;

__at(0x0F52) __sfr CCPR2H;

__at(0x0F53) __sfr CTMUICON;
__at(0x0F53) volatile __CTMUICONbits_t CTMUICONbits;

__at(0x0F54) __sfr CTMUCONL;
__at(0x0F54) volatile __CTMUCONLbits_t CTMUCONLbits;

__at(0x0F55) __sfr CTMUCONH;
__at(0x0F55) volatile __CTMUCONHbits_t CTMUCONHbits;

__at(0x0F56) __sfr PADCFG1;
__at(0x0F56) volatile __PADCFG1bits_t PADCFG1bits;

__at(0x0F57) __sfr PMD2;
__at(0x0F57) volatile __PMD2bits_t PMD2bits;

__at(0x0F58) __sfr PMD1;
__at(0x0F58) volatile __PMD1bits_t PMD1bits;

__at(0x0F59) __sfr PMD0;
__at(0x0F59) volatile __PMD0bits_t PMD0bits;

__at(0x0F5A) __sfr IOCB;
__at(0x0F5A) volatile __IOCBbits_t IOCBbits;

__at(0x0F5B) __sfr WPUB;
__at(0x0F5B) volatile __WPUBbits_t WPUBbits;

__at(0x0F5C) __sfr ANCON1;
__at(0x0F5C) volatile __ANCON1bits_t ANCON1bits;

__at(0x0F5D) __sfr ANCON0;
__at(0x0F5D) volatile __ANCON0bits_t ANCON0bits;

__at(0x0F5E) __sfr CM2CON;
__at(0x0F5E) volatile __CM2CONbits_t CM2CONbits;

__at(0x0F5E) __sfr CM2CON1;
__at(0x0F5E) volatile __CM2CON1bits_t CM2CON1bits;

__at(0x0F5F) __sfr CM1CON;
__at(0x0F5F) volatile __CM1CONbits_t CM1CONbits;

__at(0x0F5F) __sfr CM1CON1;
__at(0x0F5F) volatile __CM1CON1bits_t CM1CON1bits;

__at(0x0F60) __sfr RXB0CON;
__at(0x0F60) volatile __RXB0CONbits_t RXB0CONbits;

__at(0x0F61) __sfr RXB0SIDH;
__at(0x0F61) volatile __RXB0SIDHbits_t RXB0SIDHbits;

__at(0x0F62) __sfr RXB0SIDL;
__at(0x0F62) volatile __RXB0SIDLbits_t RXB0SIDLbits;

__at(0x0F63) __sfr RXB0EIDH;
__at(0x0F63) volatile __RXB0EIDHbits_t RXB0EIDHbits;

__at(0x0F64) __sfr RXB0EIDL;
__at(0x0F64) volatile __RXB0EIDLbits_t RXB0EIDLbits;

__at(0x0F65) __sfr RXB0DLC;
__at(0x0F65) volatile __RXB0DLCbits_t RXB0DLCbits;

__at(0x0F66) __sfr RXB0D0;
__at(0x0F66) volatile __RXB0D0bits_t RXB0D0bits;

__at(0x0F67) __sfr RXB0D1;
__at(0x0F67) volatile __RXB0D1bits_t RXB0D1bits;

__at(0x0F68) __sfr RXB0D2;
__at(0x0F68) volatile __RXB0D2bits_t RXB0D2bits;

__at(0x0F69) __sfr RXB0D3;
__at(0x0F69) volatile __RXB0D3bits_t RXB0D3bits;

__at(0x0F6A) __sfr RXB0D4;
__at(0x0F6A) volatile __RXB0D4bits_t RXB0D4bits;

__at(0x0F6B) __sfr RXB0D5;
__at(0x0F6B) volatile __RXB0D5bits_t RXB0D5bits;

__at(0x0F6C) __sfr RXB0D6;
__at(0x0F6C) volatile __RXB0D6bits_t RXB0D6bits;

__at(0x0F6D) __sfr RXB0D7;
__at(0x0F6D) volatile __RXB0D7bits_t RXB0D7bits;

__at(0x0F6E) __sfr CANSTAT;
__at(0x0F6E) volatile __CANSTATbits_t CANSTATbits;

__at(0x0F6F) __sfr CANCON;
__at(0x0F6F) volatile __CANCONbits_t CANCONbits;

